# Quiz

In [ ]:
# 1. 오라클 데이터베이스 내 파라미터 테이블을 생성 후 생성 쿼리를 작성하세요

In [ ]:
# SELECT *
# FROM KOPO_PARAM_HANJIWON;

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('SRC_TABLE', 'kopo_bankdata');

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('SRC_CON', 'mysql+pymysql://kopo:kopo@192.168.110.111:3306/kopo'); 

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('DEST_TABLE', 'kopo_bankdata_hanjiwon'); 

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('DEST_CON', 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl');

In [ ]:
# 2. 파이썬을 활용하여 mariadb 내 "kopo_bankdata" 데이터를 
# oracle에 저장하는 ETL 프로그램을 파이썬으로 작성하시오 
# (오라클 저장 시 링크 참조: https://vo.la/AL3DO)
# github.hyokwan->python->데이터베이스->오라클DB저장 파일임

In [7]:
import pandas as pd 
import pymysql 
from sqlalchemy import create_engine

inId = "kopo"
inPw = "kopo"
inIp = "192.168.110.111"
inPort ="3306"
inDbName = "kopo"

# DB 커넥션 열기(데이터베이스 접속 엔진 생성)
engine_mariadb = create_engine('mysql+pymysql://{}:{}@{}:{}/{}'.format(inId,inPw,inIp,inPort,inDbName))

bankData = pd.read_sql_query('select * from kopo_bankdata',engine_mariadb)
bankData

,bankid,age,sex,region,income,married,children,car,save_act,current_act,mortgage,pep
0,ID12101,48.0,None,INNER_CITY,17546.00,None,1.0,None,NO,NO,NO,YES
1,ID12102,40.0,MALE,TOWN,30085.10,YES,3.0,None,NO,YES,YES,NO
2,ID12103,51.0,FEMALE,INNER_CITY,NaN,None,0.0,YES,YES,YES,None,NO
3,ID12104,23.0,None,TOWN,20375.40,YES,3.0,NO,NO,YES,NO,NO
4,ID12105,57.0,FEMALE,RURAL,NaN,None,0.0,NO,YES,NO,NO,NO
...,...,...,...,...,...,...,...,...,...,...,...,...
595,ID12696,61.0,FEMALE,INNER_CITY,47025.00,None,2.0,YES,None,None,YES,NO
596,ID12697,30.0,FEMALE,INNER_CITY,9672.25,YES,0.0,YES,YES,YES,None,NO
597,ID12698,NaN,FEMALE,TOWN,15976.30,YES,0.0,YES,None,NO,NO,YES
598,ID12699,29.0,MALE,INNER_CITY,14711.80,YES,0.0,None,YES,NO,YES,NO
599,ID12700,NaN,None,None,26671.60,NO,0.0,YES,NO,YES,YES,YES

In [11]:
import pandas as pd
from sqlalchemy import create_engine,types
id = "kopo"
pw = "kopo"
ip = "192.168.110.112"
port = "1521"
dbName = "orcl"

engine = create_engine('oracle+cx_oracle://{}:{}@{}:{}/{}'.format(id,pw,ip,port,dbName)  )

In [13]:
bankData.to_sql(name='kopo_bankdata_hanjiwon', 
                    con= engine, 
                    if_exists="replace", 
                    index = False)

600

In [15]:
# 보완

tableName = 'kopo_bankdata_hanjiwon'
tableName = tableName.lower()
#### 문자컬럼에 대해서 varchar (100) 적용 _ 사용시 속도 SpeedUp 50배 
objectColumns = list(bankData.columns[bankData.dtypes == 'object'])
typeDict={}
maxLen = 100

for i in range(0, len(objectColumns)):
    # sawonData[i].str.len().max() 최대치 사용할 경우
    typeDict[ objectColumns[i] ] = types.VARCHAR(100)
#### 문자컬럼에 대해서 varchar (100) 적용 _ 사용시 속도 SpeedUp 50배 

bankData.to_sql(name=tableName, if_exists="replace", con=engine,dtype=typeDict, index=False)

600

In [ ]:
# 3.  오라클에 저장한 데이터 활용 CASEWHEN 또는 DECODE 활용 쿼리 작성 
# (만약 위 프로세스를 하나도 못한 경우 오라클 내 아무 데이터베이스로 쿼리 작성 가능) 
# * 기존 교육한 동일 쿼리 제외

In [ ]:
# SELECT A.AGE,
#    CASE WHEN AGE < 20 THEN 10
#         WHEN AGE < 30 THEN 20
#         WHEN AGE < 40 THEN 30
#         WHEN AGE < 50 THEN 40
#         WHEN AGE < 60 THEN 50
#         WHEN AGE IS NULL THEN 0
#         ELSE 60
#         END AS AGE_NEW
# FROM KOPO_BANKDATA_HANJIWON A;

# SELECT A.INCOME,
#    CASE WHEN INCOME > 50000 THEN 50000
#         WHEN INCOME < 10000 THEN 10000
#         ELSE INCOME
#         END AS INCOME_NEW
# FROM KOPO_BANKDATA_HANJIWON A;

# -- 검증 쿼리
# SELECT *
# FROM ( SELECT A.INCOME,
#        CASE WHEN INCOME > 50000 THEN 50000
#             WHEN INCOME < 10000 THEN 10000
#             ELSE INCOME
#             END AS INCOME_NEW
#        FROM KOPO_BANKDATA_HANJIWON A)
# WHERE ( (INCOME > 50000) AND (INCOME_NEW != 50000) )
# OR ( (INCOME < 10000) AND (INCOME_NEW != 10000) );

# SELECT DECODE(A.SAVE_ACT, 'YES', 'O', 'NO', 'X', 'NULL') AS SAVE_ACT_NEW,
#       A.*
# FROM KOPO_BANKDATA_HANJIWON A;